ka2_2024/src/Enums/ВидыОперацийСАТУРН/ВидыОперацийСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСАТУРН</name>
  <enumValues>
    <name>АктИнвентаризацииИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииЧтениеАктуальногоОстатка</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииЧтениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ГенерацияТокенаАвторизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковПартийЗапросРодительскихПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковПартийРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ИмпортируемаяПартияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииОтменаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПодтверждениеПриемки</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииРасчетСтатусовПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииЧтениеПартий</name>
  </enumValues>
  <enumValues>
    <name>МестоПримененияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>МестоХраненияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяВозврат</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяВозвратИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяВозвратРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяГрузУтерян</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяГрузУтерянИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяГрузУтерянРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаДокументов</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаДокументовРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаДокументовЧтение</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаСтатусов</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаСтатусовРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаСтатусовЧтение</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПеревозка</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеВозврата</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеВозвратаИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеВозвратаРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеПриемки</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеУтериГрузаПриВозврате</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеУтериГрузаПриВозвратеИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяРозничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяСписаниеВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяУтилизация</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЧтениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияИзменениеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияСменаСтатусаИзЧерновикаВАктуально</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияСменаСтатусаИзЧерновикаВОтменено</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияСозданиеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПартияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПАТЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПАТИзменениеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПАТСменаСтатусаИзЧерновикаВОтменено</name>
  </enumValues>
  <enumValues>
    <name>ПАТСменаСтатусаИзЧерновикВАктуально</name>
  </enumValues>
  <enumValues>
    <name>ПАТСозданиеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияРасчетСтатусовПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеТокенаАвторизации</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияЧтениеДокумента</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ВидыОперацийСАТУРН/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЭтоАбстрактнаяОперация(ВидОперации) Экспорт
	
	Если АбстрактныеОперации().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЭтоОперацияРаботыСКлассификаторами(ВидОперации) Экспорт

	Если ОперацииРаботыСКлассификаторами().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ЭтоОперацияЗагрузкиДокументов(ВидОперации) Экспорт

	Если ВидОперации = НакладнаяЗагрузкаДокументов
		Или ВидОперации = НакладнаяЗагрузкаДокументовРасчетСтатуса
		Или ВидОперации = НакладнаяЗагрузкаСтатусов
		Или ВидОперации = НакладнаяЗагрузкаСтатусовРасчетСтатуса Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ЭтоЗапросСписка(Операция) Экспорт
	
	Возврат Операция = НакладнаяЗагрузкаСтатусов;
	
КонецФункции

Функция ОперацияЯвляетсяОснованием(ВидОперации) Экспорт
	
	Если ОперацииОснования().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция АбстрактныеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(АктИнвентаризацииРасчетСтатуса);
	МассивОпераций.Добавить(АктПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросОстатковПартийРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяВозвратРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеВозвратаРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяГрузУтерянРасчетСтатуса);
	МассивОпераций.Добавить(ПроизводственнаяОперацияРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЗагрузкаДокументовРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусовРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииОснования() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(АктИнвентаризацииРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяВозвратРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеВозвратаРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяГрузУтерянРасчетСтатуса);
	МассивОпераций.Добавить(АктПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(ПроизводственнаяОперацияРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросОстатковПартийРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРасчетСтатуса() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ПланПримененияРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусовРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусов);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРаботыСКлассификаторами() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ПАТСозданиеКлассификатора);
	МассивОпераций.Добавить(ПАТИзменениеКлассификатора);
	МассивОпераций.Добавить(ПАТСменаСтатусаИзЧерновикаВОтменено);
	МассивОпераций.Добавить(ПАТСменаСтатусаИзЧерновикВАктуально);
	
	МассивОпераций.Добавить(ОрганизацияЗапросКлассификатора);
	МассивОпераций.Добавить(ПАТЗапросКлассификатора);
	МассивОпераций.Добавить(МестоПримененияЗапросКлассификатора);
	МассивОпераций.Добавить(МестоХраненияЗапросКлассификатора);
	МассивОпераций.Добавить(ПартияЗапросКлассификатора);
	МассивОпераций.Добавить(ИмпортируемаяПартияЗапросКлассификатора);
	
	МассивОпераций.Добавить(ОрганизацияСозданиеКлассификатора);
	МассивОпераций.Добавить(ОрганизацияИзменениеКлассификатора);
	МассивОпераций.Добавить(ОрганизацияСменаСтатусаИзЧерновикаВОтменено);
	МассивОпераций.Добавить(ОрганизацияСменаСтатусаИзЧерновикаВАктуально);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция БазовыеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	Возврат МассивОпераций;
	
КонецФункции

#КонецОбласти

#КонецЕсли
